In [1]:
import pandas as pd
import sqlite3

In [2]:
conn = sqlite3.connect('factbook.db')
pd.read_sql_query("SELECT * FROM facts LIMIT 5;", conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate,created_at,updated_at
0,1,af,Afghanistan,652230,652230,0,32564342,2.32,38.57,13.89,1.51,2015-11-01 13:19:49.461734,2015-11-01 13:19:49.461734
1,2,al,Albania,28748,27398,1350,3029278,0.30,12.92,6.58,3.30,2015-11-01 13:19:54.431082,2015-11-01 13:19:54.431082
2,3,ag,Algeria,2381741,2381741,0,39542166,1.84,23.67,4.31,0.92,2015-11-01 13:19:59.961286,2015-11-01 13:19:59.961286
3,4,an,Andorra,468,468,0,85580,0.12,8.13,6.96,0.00,2015-11-01 13:20:03.659945,2015-11-01 13:20:03.659945
4,5,ao,Angola,1246700,1246700,0,19625353,2.78,38.78,11.49,0.46,2015-11-01 13:20:08.625072,2015-11-01 13:20:08.625072

## Initial Exploration

In [3]:
pd.read_sql_query('''
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts;
''', conn)

,MIN(population),MAX(population),MIN(population_growth),MAX(population_growth)
0,0,7256490011,0.0,4.02

## Investigation
Let's look into why there's a population of 0 and a population of 7 billion.

In [4]:
pd.read_sql_query('''
SELECT *
FROM facts
WHERE population = (SELECT MIN(population) FROM facts);
''', conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate,created_at,updated_at
0,250,ay,Antarctica,None,280000,None,0,None,None,None,None,2015-11-01 13:38:44.885746,2015-11-01 13:38:44.885746

In [5]:
pd.read_sql_query('''
SELECT *
FROM facts
WHERE population = (SELECT MAX(population) FROM facts);
''', conn)

,id,code,name,area,area_land,area_water,population,population_growth,birth_rate,death_rate,migration_rate,created_at,updated_at
0,261,xx,World,None,None,None,7256490011,1.08,18.6,7.8,None,2015-11-01 13:39:09.910721,2015-11-01 13:39:09.910721

## Observations
Antarctica is a reasonable place to have 0 living population.  This data must disregard researches posted there.  Also, it should be noted that the World is included as an entry, hence the 7 billion population figure.

In [6]:
import matplotlib.pyplot as plt

In [ ]:
fig = plt.figure(figsize=(10,10))
ax = fig.addsubplot(111)

pd.read_sql_query('''
SELECT population, population_growth, birth_rate, death_rate
FROM facts
WHERE population != (S)
''', conn).hist(ax=ax)